app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("title", "sku", "price", "quantity", "image_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "sku" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["sku", "101123123100"], ["updated_at", "2021-11-18 11:26:46.681286"], ["id", 4]]